Revit 2024 API
FabricationPart.MaterialGauge Property
 The fabrication material gauge identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public int MaterialGauge { get; }
Visual Basic
Public ReadOnly Property MaterialGauge As Integer
	Get
Visual C++
public:
property int MaterialGauge {
	int get ();
}
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace